Static Public Member Functions | List of all members
ACAPI::DesignOptions::DesignOptionsManipulationRightsChecker Class Reference
Design Options
A class to check manipulation rights for Design Options. More...
#include <DesignOptionsManipulationRightsChecker.hpp>
 Static Public Member Functions
static std::optional< Error >  | CheckProjectExistanceAndWindowType ()
static std::optional< Error >  | CheckCreationRights ()
static std::optional< Error >  | CheckModificationAndDeletionRights (const GS::Guid &designOptionsTypeGuid)
Detailed Description
A class to check manipulation rights for Design Options.
Since
Archicad 29